Revit API Introduction Labs
Lab1_1_HelloWorld Methods
The Lab1_1_HelloWorld type exposes the following members.
Methods
Name | Description
Equals
 Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
Execute
 The one and only method required by the IExternalCommand interface, the main entry point for every external command.
Finalize
 Allows an Object to attempt to free resources and perform other cleanup operations before the Object is reclaimed by garbage collection.
 (Inherited from Object.)
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
 Gets the Type of the current instance.
 (Inherited from Object.)
MemberwiseClone
 Creates a shallow copy of the current Object.
 (Inherited from Object.)
ToString
 Returns a String that represents the current Object.
 (Inherited from Object.)
See Also
Lab1_1_HelloWorld Class
Labs Namespace